Repository: vendelin8/djynn
Catalog: po/*.po
Languages: sv

source: Toggle Comment(s)
sv: Infoga / Ta bort kommentar(er)

source: Toggle Block Comment(s)
sv: Infoga / Ta bort block-kommentar(er)

source: Insert Doxygen Comment(s)
sv: Infoga Doxygen kommentar(er)

source: Strip Comments
sv: Ta bort kommentarer

source: Djynn does not support comments for this file type.
sv: Djynn saknar stöd för kommentarer för denna filtyp.

source: Doxygen does not support this language.
sv: Doxygen stödjer inte detta språk.

source: Djynn does not support strip comments for this file type.
sv: Djynn saknar stöd för att ta bort kommentarer för denna filtyp.

source: Select Folder
sv: Välj mapp

source: New Workspace
sv: Ny arbetsyta

source: Rename Workspace
sv: Döp om arbetsyta

source: Workspace Name:
sv: Arbetsytans namn:

source: Select a name for your workspace!
sv: Välj ett namn för din arbetsyta!

source: New Session
sv: Ny session

source: Rename Session
sv: Döp om sesion

source: Session Name:
sv: Sessionens namn:

source: Select a name for your session!
sv: Välj ett namn för din session!

source: New Project
sv: Nytt projekt

source: Project Preferences
sv: Projektinställningar

source: No project has been selected for editing preferences!
sv: Inget projekt valt för ändring av inställningar!

source: Project Name:
sv: Projektets namn:

source: Base Path:
sv: Rotkatalog:

source: Description:
sv: Beskrivning:

source: Select a name for your project!
sv: Välj ett namn för ditt projekt!

source: Not a valid directory!
sv: Inte en riktig katalog!

source: Project "%s" already exists, delete the old project or select another name!
sv: Projektet "%s" finns redan, ta bort det gamla projektet eller välj annat namn!

source: Folder Preferences
sv: Mappinställningar

source: New Folder
sv: Ny mapp

source: No project, folder or file selected!
sv: Varken projekt, mapp eller fil markerad!

source: Folder Name:
sv: Mappnamn:

source: Add files in directory
sv: Lägg till filer i katalogen

source: Recurse in subfolders
sv: Sök i underkataloger

source: Dynamically load files in folder
sv: Ladda filer i mappen dynamiskt

source: Match files with regex-pattern:
sv: Matcha filer med regex-kod:

source: Select a name for the folder!
sv: Välj ett namn för katalogen!

source: New File
sv: Ny fil

source: File Name:
sv: Filnamn:

source: Select a name for the file!
sv: Välj ett namn för filen!

source: Properties
sv: Egenskaper

source: No file selected!
sv: Ingen fil markerad!

source: Name
sv: Namn

source: Location
sv: Plats

source: Accessed
sv: Åtkommen

source: Modified
sv: Ändrad

source: Size
sv: Storlek

source: User
sv: Användare

source: Group
sv: grupp

source: Hard Links
sv: Hårda länkar

source: Browse...
sv: Bläddra...

source: A small project manager, with some additional functionality; encoding/decoding, commenting and sorting, etc.
sv: En liten projekthanterare, med diverse extra funktionalitet; formattering, kommentarer, radsortering, etc.

source: Comments
sv: Kommentarer

source: Project Manager
sv: Projekthanteraren

source: Check to activate the Djynn Project Manager.
sv: Kryssa i för att aktivera Djynn Projekthanteraren.

source: Left
sv: Vänster

source: Right
sv: Höger

source: Sidebar Page
sv: Flik i sidofältet

source: Open Directory:
sv: Öppna katalog:

source: The command to execute with "Open Directory" in the project manager. You can use %f and %d wildcards: - %f will be replaced with the filename including full path - %d will be replaced with the path name of the selected file without the filename
sv: Kommandot att exekvera med "Öppna katalog". Du kan använda %f och %d. - %f kommer att ersättas med filnamnet och fullständig sökväg - %d kommer att ersättas med sökvägen till vald fil (utan filnamnet)

source: Workspace List:
sv: Lista över arbetsytor:

source: Bottom
sv: Botten

source: Hidden
sv: Dold

source: Top
sv: Topp

source: Sessions List:
sv: Lista över sessioner:

source: Show Icons:
sv: Visa ikoner:

source: Basic Icons
sv: Standardikoner

source: Icons by Content-type
sv: Ikoner efter filtyp

source: None
sv: Inte

source: Icons shown for documents in Project manager tree view.
sv: Ikoner som visas i projekthanterarens trädvy.

source: Show tree lines
sv: Visa linjer

source: Single click, open document and focus it
sv: Enkelklick öppnar och visar dokument

source: Double click open directory
sv: Dubbelklick öppnar katalog

source: Activate project opens config-file instead of Geany project
sv: Aktivering av projekt öppnar konfigurationsfil

source: When double clicking on the project, the project configuration file is opened in the editor instead of opening the Geany project (see Project in the menu).
sv: Vid dubbelklick på projektet öppnas konfigurationsfilen i redigeraren istället för att öppna Geany-projektet (se Projekt i menyn).

source: Activate document also activates sidebar page
sv: Aktivering av dokument aktiverar även sidofältet

source: When opening a document in the editor, if another page is visible in the sidebar the Project tab is automatically activated.
sv: När ett dokument öppnas i redigeraren, om en annan sida är synlig i sidofältet, aktiveras automatiskt Projekt-fliken.

source: Check to activate Djynn Comments.
sv: Kryssa i för att aktivera Djynn Kommentarer.

source: Replace Geany's built in commenting functions
sv: Byt ut Geanys inbyggda kommentarsfunktioner

source: Line Ordering
sv: Ordna rader

source: Check to activate Djynn Line Ordering.
sv: Kryssa i för att aktivera Djynn Ordna Rader.

source: Format entire document when no text is selected
sv: Ändra hela dokumentet när ingen text är markerad

source: Encode & Decode
sv: Koda & avkoda

source: Check to activate Djynn Encode & Decode.
sv: Kryssa i för att aktivera Djynn Kodning & Avkodning.

source: Workspace
sv: Arbetsyta

source: Encode Hexadecimal
sv: Koda hexadecimalt

source: Decode Hexadecimal
sv: Avkoda hexadecimalt

source: Encode Base58
sv: Koda 58-bas

source: Decode Base58
sv: Avkoda 58-bas

source: Encode Base64
sv: Koda 64-bas

source: Decode Base64
sv: Avkoda 64-bas

source: C String Escape
sv: Koda C-sträng

source: C String Unescape
sv: Avkoda C-sträng

source: HTML Encode
sv: Koda HTML

source: HTML Decode
sv: Avkoda HTML

source: URL Encode
sv: Koda URL

source: URL Decode
sv: Avkoda URL

source: Sort Asc. [aA-zZ]
sv: Sortera stigande [aA-zZ]

source: Sort Asc. Case [a-z-A-Z]
sv: Sortera stigande [a-z-A-Z]

source: Sort Desc. [Zz-Aa]
sv: Sortera sjunkande [Zz-Aa]

source: Sort Desc. Case [Z-A-z-a]
sv: Sortera sjunkande [Z-A-z-a]

source: Reverse Lines
sv: Omvänd radordning

source: Remove Duplicate Lines
sv: Ta bort identiska rader

source: New Project...
sv: Nytt projekt...

source: Open File
sv: Öppna fil

source: Open All Files
sv: Öppna alla filer

source: Open Directory
sv: Öppna katalog

source: Open Terminal
sv: Öppna terminal

source: Close File
sv: Stäng fil

source: New Folder...
sv: Ny katalog...

source: New File...
sv: Ny fil...

source: Add Active File
sv: Lägg till aktiv fil

source: Add All Open Files
sv: Lägg till alla öppna filer

source: Remove
sv: Ta bort

source: Delete From Disk
sv: Ta bort från disken

source: Sort Files
sv: Sortera filer

source: Move Up
sv: Flytta upp

source: Move Down
sv: Flytta ner

source: Reload Workspace
sv: Ladda om arbetsyta

source: Hide Sidebar
sv: Göm sidolist

source: Cannot drag-n-drop virtual files and folders.
sv: Kan inte flytta virtuella filer och mappar.

source: Cannot drag-n-drop into virtual files and folders.
sv: Kan inte flytta till virtuella filer och mappar.

source: Cannot drag-n-drop into dynamically loaded files and folders.
sv: Kan inte flytta till dynamiskt laddade filer och mappar.

source: dynamic
sv: dynamisk

source: virtual
sv: virtuell

source: Config File
sv: Konfigurationsfil

source: Project
sv: Projekt

source: Folder
sv: Mapp

source: File
sv: Fil

source: Delete Project
sv: Ta bort projekt

source: Remove Project
sv: Ta bort projekt

source: Are you sure you want to permanently delete project "%s" from disk? Project files and folders remain untouched, only the project is deleted.
sv: Är du säker på att du vill ta bort projektet "%s" från hårddisken? Projektets filer och kataloger förblir orörda, endast projektet raderas.

source: Are you sure you want to remove project "%s" from this workspace?
sv: Är du säker på att du vill ta bort projektet "%s" från denna arbetsytan?

source: Delete Folder
sv: Ta bort katalog

source: Remove Folder
sv: Ta bort katalog

source: Are you sure you want to permanently delete folder "%s" and all its files and subfolders from disk?
sv: Är du säker på att du vill ta bort katalogen "%s" och alla filer och underkataloger från hårddisken?

source: Are you sure you want to remove folder "%s" and all its files and subfolders from the project?
sv: Är du säker på att du vill ta bort katalogen "%s" och alla filer och underkataloger från projektet?

source: Delete File
sv: Ta bort fil

source: Remove File
sv: Stäng fil

source: Are you sure you want to permanently delete file "%s" from disk?
sv: Är du säker på att du vill ta bort filen "%s" från hårddisken?

source: Are you sure you want to remove file "%s" from the project?
sv: Är du säker på att du vill ta bort filen "%s" från projektet?

source: Could not execute configured external command '%s' (%s).
sv: Kunde inte exekvera det externa kommandot '%s' (%s).

source: Not a valid directory or file: %s
sv: Inte en riktig katalog eller fil: %s

source: Could not open terminal '%s' for directory: %s
sv: Kunde inte öppna terminalen '%s' för katalogen: %s

source: New Session...
sv: Ny session...

source: Save Session
sv: Spara session

source: Rename Session...
sv: Döp om sesion...

source: Reload Session
sv: Ladda om session

source: Delete Session
sv: Ta bort session

source: The file "%s" no longer exists.
sv: Filen "%s" existerar inte längre.

source: Are you sure you want to delete the session "%s"?
sv: Är du säker på att du vill ta bort sessionen "%s"?

source: There must be at least one session!
sv: Det måste finnas åtminstone en session!

source: Switch between sessions.
sv: Växla mellan sessioner.

source: New Workspace...
sv: Ny arbetsyta...

source: Rename Workspace...
sv: Döp om arbetsyta...

source: Delete Workspace
sv: Ta bort arbetsyta

source: Are you sure you want to delete the entire workspace "%s" and all its projects?
sv: Är du säker på att du vill ta bort hela arbetsytan "%s" och alla dess projekt?

source: There must be at least one workspace!
sv: Det måste finnas åtminstone en arbetsyta!

source: Switch between workspaces.
sv: Växla mellan arbetsytor.
